#################################################################
#######################第一题 顺序结构的编程########################
# 计算y=10a+6b-c,其中y放在寄存器a0中，a、b、c三个变量存放的寄存器不限。
## 要求不用乘法指令。
#### y在a0；a在a1，b在a2，c在a3
#### 救命要考试了啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊
##### 一定延期啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊
#################################################################

################数据段###################
.data 
# 数据定义
a:	.word 0
b:	.word 0
c:	.word 0
y:	.word 0
# 输出信息
StartMsg:  .string "\n计算y=10a+6b-c"
InputaMsg: .string "\n请输入a："
InputbMsg: .string "请输入b："
InputcMsg: .string "请输入c："
ResultMsg: .string "\n计算结果为："


################代码段###################
.text
#######输入a，b，c#######

# --------------输出StartMsg--------------
la a0,StartMsg	# 将字符串StartMsg首址放入a0
li a7,4		# 功能号放入a7，4号表示字符串的输出
ecall		# 系统调用

# --------------输出InputaMsg--------------
la a0,InputaMsg	# 将字符串InputaMsg首址放入a0
li a7,4     	# 功能号放入a7，4号表示字符串的输出 
ecall		# 系统调用

# --------------输入a--------------
li a7,5		# 功能号放入a7，5号表示输入一个整数到a0
ecall		# 系统调用
sw a0,a,t1	# 将寄存器a0值放入变量a

# --------------输出InputbMsg--------------
la a0,InputbMsg	# 将字符串InputbMsg首址放入a0
li a7,4     	# 功能号放入a7，4号表示字符串的输出
ecall		# 系统调用

# --------------输入b--------------
li a7,5		# 功能号放入a7，5号表示输入一个整数到a0
ecall		# 系统调用
sw a0,b,t1	# 将寄存器a0值放入变量b

# --------------输出InputbMsg--------------
la a0,InputcMsg	# 将字符串InputcMsg首址放入a0
li a7,4     	# 功能号放入a7，4号表示字符串的输出
ecall		# 系统调用

# --------------输入c--------------
li a7,5		# 功能号放入a7，5号表示输入一个整数到a0
ecall		# 系统调用
sw a0,c,t1	# 将寄存器a0值放入变量c

# --------------输出ResultMsg--------------
la a0,ResultMsg	# 将字符串ResultMsg首址放入a0
li a7,4		# 功能号放入a7，4号表示字符串的输出
ecall		# 系统调用

#######开始计算#######
lw a1,a		# 将a的值赋给a1寄存器
lw a2,b		# 将b的值赋给a2寄存器
lw a3,c		# 将c的值赋给a3寄存器
# -------------计算10a，10a=8a+2a(因为不可以用乘法，采用移位)------------
slli t1,a1,3	# 计算8a，并放入t1
slli t2,a1,1	# 计算2a，并放入t2
add a1,t1,t2	# 计算8a+2a，并放回a1

# --------------------计算6b，6b=4b+2b(原因同上)----------------------
slli t1,a2,2	# 计算4b，并放入t1
slli t2,a2,1	# 计算2b，并放入t2
add a2,t1,t2	# 计算4b+2b，并放回a2

# -------------------------计算10a+6b--------------------------------
add t1,a1,a2	# 计算a1+a2，并放入t1

# -------------------------计算10a+6b-c------------------------------
sub t2,t1,a3	# 计算最终结果，10a+6b-c结果y放入t2中
sw t2,y,t1	# 将寄存器t2的值存入变量y中

# -------------------------输出计算结果y-------------------------------
lw a0,y		# 将y的值放入寄存器a0
li a7,1        # 功能号放入a7，1号表示整数的输出
ecall          # 系统调用命令

# --------------------------退出程序-----------------------------------
addi a7, zero, 10	# 系统调用,功能号为10。功能： 结束退出，即exit
ecall           	# 系统调用命令









