###################################################################
#######################第三题 循环结构的编程########################
# 计算y=1+2+3…+100，y存放在寄存器a2中。
#### 肚子好饿啊啊啊啊啊 写完才可以吃
################################################################

################数据段###################
.data 
# 数据定义
y:	.word 0		# 结果y
iMax:	.word 100	# i的最大值
# 输出信息
StartMsg:  .string "计算y=1+2+3…+100"
RusultMsg: .string "\n结果为：y="


################代码段###################
.text
# 变量分别加载到寄存器，i->a1;y->a2;iMax->a3
main:
	add a1,a1,zero
	lw a2,y
	lw a3,iMax
	
# 输出一些提示信息
Output:
	la a0,StartMsg		# 将字符串StartMsg首址放入a0
	li a7,4				# 功能号放入a7，4号表示字符串的输出
	ecall				# 系统调用
	la a0,RusultMsg		# 将字符串StartMsg首址放入a0
	li a7,4				# 功能号放入a7，4号表示字符串的输出
	ecall				# 系统调用

# 进行判断，当i<iMax(100)时进行跳转到循环；当不满足时跳转到exit输出结果退出程序
judge:
	ble a1,a3,loop		# i<=100 Jump loop：
	j exit				# if(i>100) Jump exit：

# 循环
loop:
	lw a2,y				# 将y的值加载到寄存器a2中
	add t1,a2,a1		# t1=y+i
	sw t1,y,t2			# y=t1
	addi a1,a1,1		# i++
	j judge				# 跳转到判断judge:

# 输出结果，程序退出
exit:
	lw a0,y				# 将y的值读取到寄存器a0中（为了系统调用输出）
	li a7,1				# 在a7寄存器设置功能号1(整数输出)
	ecall				# 系统调用
	li a7,10			# 在a7寄存器设置功能号10(exit(0))
	ecall				# 系统调用
